; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=195, out_folder=htg/blocksworld/training, instance_id=25, seed=2049, goal_proportion=0.03

(define (problem blocksworld-25)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 - object)
 (:init 
    (arm-empty)
    (clear b95)
    (on b95 b27)
    (on b27 b166)
    (on b166 b168)
    (on-table b168)
    (clear b17)
    (on b17 b148)
    (on b148 b39)
    (on b39 b194)
    (on b194 b100)
    (on b100 b107)
    (on b107 b101)
    (on b101 b178)
    (on b178 b6)
    (on b6 b75)
    (on-table b75)
    (clear b169)
    (on b169 b185)
    (on b185 b34)
    (on b34 b83)
    (on-table b83)
    (clear b16)
    (on b16 b109)
    (on b109 b12)
    (on b12 b191)
    (on-table b191)
    (clear b133)
    (on b133 b105)
    (on-table b105)
    (clear b92)
    (on b92 b13)
    (on b13 b43)
    (on-table b43)
    (clear b113)
    (on b113 b19)
    (on b19 b164)
    (on b164 b59)
    (on b59 b42)
    (on b42 b131)
    (on b131 b51)
    (on b51 b81)
    (on b81 b41)
    (on b41 b179)
    (on b179 b127)
    (on b127 b35)
    (on b35 b88)
    (on-table b88)
    (clear b93)
    (on-table b93)
    (clear b135)
    (on b135 b184)
    (on-table b184)
    (clear b52)
    (on b52 b96)
    (on b96 b74)
    (on b74 b182)
    (on b182 b128)
    (on b128 b36)
    (on b36 b143)
    (on b143 b54)
    (on b54 b97)
    (on b97 b76)
    (on b76 b122)
    (on-table b122)
    (clear b183)
    (on b183 b117)
    (on b117 b48)
    (on b48 b162)
    (on b162 b156)
    (on-table b156)
    (clear b130)
    (on b130 b38)
    (on b38 b91)
    (on b91 b124)
    (on-table b124)
    (clear b174)
    (on b174 b187)
    (on b187 b108)
    (on b108 b121)
    (on-table b121)
    (clear b14)
    (on b14 b158)
    (on b158 b171)
    (on b171 b115)
    (on b115 b70)
    (on b70 b144)
    (on-table b144)
    (clear b37)
    (on-table b37)
    (clear b119)
    (on b119 b120)
    (on b120 b55)
    (on b55 b53)
    (on b53 b9)
    (on b9 b87)
    (on b87 b170)
    (on b170 b78)
    (on b78 b99)
    (on-table b99)
    (clear b65)
    (on b65 b3)
    (on b3 b22)
    (on b22 b89)
    (on b89 b47)
    (on-table b47)
    (clear b64)
    (on b64 b1)
    (on-table b1)
    (clear b118)
    (on b118 b116)
    (on b116 b125)
    (on b125 b60)
    (on b60 b161)
    (on b161 b45)
    (on b45 b25)
    (on b25 b193)
    (on-table b193)
    (clear b33)
    (on b33 b5)
    (on-table b5)
    (clear b69)
    (on b69 b30)
    (on-table b30)
    (clear b150)
    (on b150 b145)
    (on b145 b186)
    (on-table b186)
    (clear b72)
    (on b72 b68)
    (on b68 b29)
    (on b29 b57)
    (on b57 b155)
    (on-table b155)
    (clear b146)
    (on b146 b79)
    (on b79 b63)
    (on b63 b152)
    (on b152 b40)
    (on b40 b18)
    (on b18 b123)
    (on b123 b160)
    (on-table b160)
    (clear b181)
    (on b181 b15)
    (on b15 b142)
    (on-table b142)
    (clear b20)
    (on b20 b32)
    (on b32 b195)
    (on b195 b110)
    (on b110 b11)
    (on-table b11)
    (clear b85)
    (on-table b85)
    (clear b71)
    (on-table b71)
    (clear b84)
    (on b84 b139)
    (on b139 b177)
    (on b177 b153)
    (on b153 b126)
    (on b126 b24)
    (on b24 b129)
    (on-table b129)
    (clear b82)
    (on b82 b50)
    (on-table b50)
    (clear b98)
    (on-table b98)
    (clear b112)
    (on-table b112)
    (clear b165)
    (on b165 b167)
    (on b167 b26)
    (on b26 b172)
    (on b172 b141)
    (on b141 b159)
    (on-table b159)
    (clear b192)
    (on-table b192)
    (clear b189)
    (on b189 b56)
    (on b56 b61)
    (on-table b61)
    (clear b8)
    (on b8 b21)
    (on b21 b163)
    (on-table b163)
    (clear b102)
    (on b102 b77)
    (on b77 b67)
    (on b67 b137)
    (on b137 b104)
    (on b104 b49)
    (on-table b49)
    (clear b175)
    (on b175 b23)
    (on-table b23)
    (clear b86)
    (on b86 b138)
    (on b138 b94)
    (on b94 b58)
    (on b58 b2)
    (on b2 b73)
    (on b73 b10)
    (on-table b10)
    (clear b132)
    (on b132 b151)
    (on b151 b62)
    (on b62 b7)
    (on b7 b80)
    (on b80 b114)
    (on b114 b44)
    (on b44 b180)
    (on b180 b103)
    (on b103 b46)
    (on-table b46)
    (clear b190)
    (on b190 b173)
    (on b173 b157)
    (on-table b157)
    (clear b136)
    (on b136 b140)
    (on b140 b90)
    (on b90 b188)
    (on b188 b31)
    (on b31 b4)
    (on b4 b154)
    (on b154 b111)
    (on b111 b147)
    (on b147 b106)
    (on b106 b149)
    (on b149 b176)
    (on b176 b28)
    (on-table b28)
    (clear b66)
    (on b66 b134)
    (on-table b134))
 (:goal  (and 
    (clear b1)
    (on b1 b4)
    (on b4 b3)
    (on b3 b5)
    (on-table b5)
    (clear b2)
    (on-table b2))))

; plan
1. (unstack b136 b140)
   deleted: (on b136 b140) (clear b136) (arm-empty)
   added: (holding b136) (clear b140)
   goals met: 1 of 7
2. (putdown b136)
   deleted: (holding b136)
   added: (clear b136) (arm-empty) (on-table b136)
   goals met: 1 of 7
3. (unstack b140 b90)
   deleted: (on b140 b90) (clear b140) (arm-empty)
   added: (holding b140) (clear b90)
   goals met: 1 of 7
4. (putdown b140)
   deleted: (holding b140)
   added: (clear b140) (arm-empty) (on-table b140)
   goals met: 1 of 7
5. (unstack b33 b5)
   deleted: (on b33 b5) (clear b33) (arm-empty)
   added: (holding b33) (clear b5)
   goals met: 1 of 7
6. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 1 of 7
7. (unstack b64 b1)
   deleted: (on b64 b1) (clear b64) (arm-empty)
   added: (holding b64) (clear b1)
   goals met: 2 of 7
8. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 2 of 7
9. (unstack b65 b3)
   deleted: (on b65 b3) (clear b65) (arm-empty)
   added: (holding b65) (clear b3)
   goals met: 2 of 7
10. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 2 of 7
11. (unstack b86 b138)
   deleted: (on b86 b138) (clear b86) (arm-empty)
   added: (holding b86) (clear b138)
   goals met: 2 of 7
12. (putdown b86)
   deleted: (holding b86)
   added: (clear b86) (arm-empty) (on-table b86)
   goals met: 2 of 7
13. (unstack b138 b94)
   deleted: (on b138 b94) (clear b138) (arm-empty)
   added: (holding b138) (clear b94)
   goals met: 2 of 7
14. (putdown b138)
   deleted: (holding b138)
   added: (clear b138) (arm-empty) (on-table b138)
   goals met: 2 of 7
15. (unstack b90 b188)
   deleted: (on b90 b188) (clear b90) (arm-empty)
   added: (holding b90) (clear b188)
   goals met: 2 of 7
16. (putdown b90)
   deleted: (holding b90)
   added: (clear b90) (arm-empty) (on-table b90)
   goals met: 2 of 7
17. (unstack b188 b31)
   deleted: (on b188 b31) (clear b188) (arm-empty)
   added: (holding b188) (clear b31)
   goals met: 2 of 7
18. (putdown b188)
   deleted: (holding b188)
   added: (clear b188) (arm-empty) (on-table b188)
   goals met: 2 of 7
19. (unstack b31 b4)
   deleted: (on b31 b4) (clear b31) (arm-empty)
   added: (holding b31) (clear b4)
   goals met: 2 of 7
20. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 2 of 7
21. (unstack b94 b58)
   deleted: (on b94 b58) (clear b94) (arm-empty)
   added: (holding b94) (clear b58)
   goals met: 2 of 7
22. (putdown b94)
   deleted: (holding b94)
   added: (clear b94) (arm-empty) (on-table b94)
   goals met: 2 of 7
23. (unstack b58 b2)
   deleted: (on b58 b2) (clear b58) (arm-empty)
   added: (holding b58) (clear b2)
   goals met: 3 of 7
24. (putdown b58)
   deleted: (holding b58)
   added: (clear b58) (arm-empty) (on-table b58)
   goals met: 3 of 7
25. (unstack b2 b73)
   deleted: (on b2 b73) (clear b2) (arm-empty)
   added: (holding b2) (clear b73)
   goals met: 2 of 7
26. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 4 of 7
27. (unstack b3 b22)
   deleted: (on b3 b22) (clear b3) (arm-empty)
   added: (holding b3) (clear b22)
   goals met: 4 of 7
28. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 5 of 7
29. (unstack b4 b154)
   deleted: (on b4 b154) (clear b4) (arm-empty)
   added: (holding b4) (clear b154)
   goals met: 5 of 7
30. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 6 of 7
31. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 5 of 7
32. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 7 of 7
